<a href="https://colab.research.google.com/github/javilledo/machine-learning/blob/master/notebooks/t01_02_data_cleaning_an%C3%A1lisis_preliminar_de_los_datos.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#DATOS, DIMENSIONES Y ESTRUCTURAS

In [8]:
# CARGA DE LIBRERÍAS
import pandas as pd

# CARGA DE DATOS DESDE ARCHIVO
mainpath = '/content/'
filename = 'titanic3.csv'
fullpath = mainpath + filename
data = pd.read_csv(fullpath)

# CARGA DE DATOS DESDE URL
url = 'https://raw.githubusercontent.com/javilledo/python-ml-course/master/datasets/titanic/titanic3.csv'
data = pd.read_csv(url)

In [9]:
data.head() # datos iniciales, se le puede poner en el paréntesis la cantidad

   pclass  survived  ...   body                        home.dest
0       1         1  ...    NaN                     St Louis, MO
1       1         1  ...    NaN  Montreal, PQ / Chesterville, ON
2       1         0  ...    NaN  Montreal, PQ / Chesterville, ON
3       1         0  ...  135.0  Montreal, PQ / Chesterville, ON
4       1         0  ...    NaN  Montreal, PQ / Chesterville, ON

[5 rows x 14 columns]

In [11]:
data.tail() # datos finales, se le puede poner en el paréntesis la cantidad

      pclass  survived                       name  ... boat   body  home.dest
1304       3         0       Zabour, Miss. Hileni  ...  NaN  328.0        NaN
1305       3         0      Zabour, Miss. Thamine  ...  NaN    NaN        NaN
1306       3         0  Zakarian, Mr. Mapriededer  ...  NaN  304.0        NaN
1307       3         0        Zakarian, Mr. Ortin  ...  NaN    NaN        NaN
1308       3         0         Zimmerman, Mr. Leo  ...  NaN    NaN        NaN

[5 rows x 14 columns]

In [10]:
data.shape # tamaño de los datos

(1309, 14)

In [13]:
data.columns.values # valores de los campos

array(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype=object)

# ESTADÍSTICOS BÁSICOS

In [14]:
data.describe() # estadísticos básicos

            pclass     survived  ...         fare        body
count  1309.000000  1309.000000  ...  1308.000000  121.000000
mean      2.294882     0.381971  ...    33.295479  160.809917
std       0.837836     0.486055  ...    51.758668   97.696922
min       1.000000     0.000000  ...     0.000000    1.000000
25%       2.000000     0.000000  ...     7.895800   72.000000
50%       3.000000     0.000000  ...    14.454200  155.000000
75%       3.000000     1.000000  ...    31.275000  256.000000
max       3.000000     1.000000  ...   512.329200  328.000000

[8 rows x 7 columns]

In [16]:
data.dtypes # tipos de datos de cada variable

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

# MISSING VALUES

In [17]:
pd.isnull(data['body']) # valores nulos en el campo body

0        True
1        True
2        True
3       False
4        True
        ...
1304    False
1305     True
1306    False
1307     True
1308     True
Name: body, Length: 1309, dtype: bool

In [18]:
pd.notnull(data['body']) # valores no nulos en el campo body

0       False
1       False
2       False
3        True
4       False
        ...
1304     True
1305    False
1306     True
1307    False
1308    False
Name: body, Length: 1309, dtype: bool

In [19]:
pd.isnull(data['body']).values # valores nulos, convertido en array

array([ True,  True,  True, ..., False,  True,  True])

In [21]:
pd.isnull(data['body']).values.ravel().sum() # suma de Trues, porque True = 1 y False = 0. ravel es como un flatten

1188

In [22]:
pd.notnull(data['body']).values.ravel().sum() # suma de los no nulos, que coincide con lo indicado en describe()

121

Los valores que faltan en un datasets pueden ser debidos a dos razones:
* Extracción de los datos de alguna base de datos
* Recolección de los datos

## BORRADO DE VALORES

In [23]:
data.dropna(axis=0,how='all') # se borran las filas (axis = 0) en las que todos los datos son nulos (how = all)

      pclass  survived  ...   body                        home.dest
0          1         1  ...    NaN                     St Louis, MO
1          1         1  ...    NaN  Montreal, PQ / Chesterville, ON
2          1         0  ...    NaN  Montreal, PQ / Chesterville, ON
3          1         0  ...  135.0  Montreal, PQ / Chesterville, ON
4          1         0  ...    NaN  Montreal, PQ / Chesterville, ON
...      ...       ...  ...    ...                              ...
1304       3         0  ...  328.0                              NaN
1305       3         0  ...    NaN                              NaN
1306       3         0  ...  304.0                              NaN
1307       3         0  ...    NaN                              NaN
1308       3         0  ...    NaN                              NaN

[1309 rows x 14 columns]

In [24]:
data2 =data

In [25]:
data2.dropna(axis = 0, how = 'any')

Empty DataFrame
Columns: [pclass, survived, name, sex, age, sibsp, parch, ticket, fare, cabin, embarked, boat, body, home.dest]
Index: []

## INFERENCIA DE VALORES

*.fillna* no sobreescribe, para esto tenemos que volver a asignarlo a la variable

In [26]:
data3 = data

In [27]:
data3.fillna(0) # rellena todos los valores que faltan con un 0

      pclass  survived  ...   body                        home.dest
0          1         1  ...    0.0                     St Louis, MO
1          1         1  ...    0.0  Montreal, PQ / Chesterville, ON
2          1         0  ...    0.0  Montreal, PQ / Chesterville, ON
3          1         0  ...  135.0  Montreal, PQ / Chesterville, ON
4          1         0  ...    0.0  Montreal, PQ / Chesterville, ON
...      ...       ...  ...    ...                              ...
1304       3         0  ...  328.0                                0
1305       3         0  ...    0.0                                0
1306       3         0  ...  304.0                                0
1307       3         0  ...    0.0                                0
1308       3         0  ...    0.0                                0

[1309 rows x 14 columns]

In [29]:
data4 = data

In [30]:
data4.fillna('desconocido')

      pclass  survived  ...         body                        home.dest
0          1         1  ...  desconocido                     St Louis, MO
1          1         1  ...  desconocido  Montreal, PQ / Chesterville, ON
2          1         0  ...  desconocido  Montreal, PQ / Chesterville, ON
3          1         0  ...          135  Montreal, PQ / Chesterville, ON
4          1         0  ...  desconocido  Montreal, PQ / Chesterville, ON
...      ...       ...  ...          ...                              ...
1304       3         0  ...          328                      desconocido
1305       3         0  ...  desconocido                      desconocido
1306       3         0  ...          304                      desconocido
1307       3         0  ...  desconocido                      desconocido
1308       3         0  ...  desconocido                      desconocido

[1309 rows x 14 columns]

In [31]:
data5 = data

In [34]:
data5['body'] = data5['body'].fillna(0) # ahora el reemplazo se particulariza para cada columna
data5['home.dest'] = data5['home.dest'].fillna('desconocido')
data5.tail()

      pclass  survived                       name  ... boat   body    home.dest
1304       3         0       Zabour, Miss. Hileni  ...  NaN  328.0  desconocido
1305       3         0      Zabour, Miss. Thamine  ...  NaN    0.0  desconocido
1306       3         0  Zakarian, Mr. Mapriededer  ...  NaN  304.0  desconocido
1307       3         0        Zakarian, Mr. Ortin  ...  NaN    0.0  desconocido
1308       3         0         Zimmerman, Mr. Leo  ...  NaN    0.0  desconocido

[5 rows x 14 columns]

In [38]:
pd.isnull(data['age']).values.ravel().sum()

263

In [41]:
data5['age'].fillna(data['age'].mean()) # reemplazar con la media

0       29.000000
1        0.916700
2        2.000000
3       30.000000
4       25.000000
          ...
1304    14.500000
1305    29.881135
1306    26.500000
1307    27.000000
1308    29.000000
Name: age, Length: 1309, dtype: float64

In [45]:
data5['age'].fillna(method = 'ffill') # rellena los NaN hacia alante

0       29.0000
1        0.9167
2        2.0000
3       30.0000
4       25.0000
         ...
1304    14.5000
1305    14.5000
1306    26.5000
1307    27.0000
1308    29.0000
Name: age, Length: 1309, dtype: float64

In [46]:
data5['age'].fillna(method = 'backfill') # rellena los NaN hacia atrás

0       29.0000
1        0.9167
2        2.0000
3       30.0000
4       25.0000
         ...
1304    14.5000
1305    26.5000
1306    26.5000
1307    27.0000
1308    29.0000
Name: age, Length: 1309, dtype: float64

# VARIABLES DUMMY